app/controllers/bookings_controller.rb

  def show
    @booking = Booking.find(params[:id])
---
SELECT * FROM `bookings` WHERE (`bookings`.`id` = 1)

  def edit
    @booking = Booking.find(params[:id])
---
SELECT * FROM `bookings` WHERE (`bookings`.`id` = 7)

  def create

    handle_redirection Booking.create_bookings params,current_user
---
INSERT INTO `bookings` (`user_id`, `property_id`, `from`, `to`, `no_guest`, `created_at`, `updated_at`) VALUES(NULL, NULL, '2014-07-17', '2014-07-17', 4, '2014-07-17 10:23:59', '2014-07-17 10:23:59')

  def update
     from=combine_date params[:booking],"from"
    to=combine_date params[:booking],"to"
    pr=Property.find(params[:booking][:property_id])

    avail=date_avail?(pr,from,to) && accomodate_guests?(pr,params[:booking][:no_guest])

   if avail

    @booking = Booking.find(params[:id])

      if @booking.update_attributes(params[:booking])
---
SELECT * FROM `bookings` WHERE (`bookings`.`id` = 23)
SELECT * FROM `properties` WHERE (`properties`.`id` = 11)
UPDATE `bookings` SET `to` = '2014-09-22', `updated_at` = '2014-07-17 17:39:56' WHERE `id` = 23