app/controllers/properties_controller.rb

SELECT * FROM `properties` WHERE (`properties`.`id` = 1)
---
  def show
    @property = Property.find(params[:id])

SELECT * FROM `properties` WHERE (`properties`.`id` = 1)
---
  def edit
    @property = Property.find(params[:id])

INSERT INTO `properties` (`name`, `roomtype`, `price`, `city`, `address`, `guest`, `avail_from`, `avail_to`, `created_at`, `updated_at`, `housetype`) VALUES('fdasflkasdklfjadslkjf', 'Entire Home', 1000.0, 'chennai', 'C2 Krishna Block, Selvam Estates, 6th Cross st, New Colony, Chrompet', 4, '2014-07-16', '2014-07-16', '2014-07-16 12:09:18', '2014-07-16 12:09:18', 'Apartment')
---
  def create
   handle_redirection  Property.create_properties params,current_user

UPDATE `properties` SET `name` = 'sadf1', `roomtype` = 'Entire Home', `housetype` = 'Apartment', `price` = 1000.22, `city` = 'chennai', `address` = 'C2 Krishna Block, Selvam Estates, 6th Cross st, New Colony, Chrompet', `guest` = 10, `avail_from` = '2014-07-16', `avail_to` = '2014-07-16', `updated_at` = '2014-07-16 11:41:46' WHERE `id` = 1
---
  def update
    handle_redirection Property.update_properties params,current_user

SELECT * FROM `properties` WHERE (`properties`.`id` = 1)
DELETE FROM `properties` WHERE `id` = 1
---
  def destroy
    @property = Property.find(params[:id])
    @property.destroy