app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `crypted_password`, `password_salt`, `persistence_token`, `created_at`, `updated_at`, `phone`, `gender`) VALUES('dddd', 'dd@gmail.com', 'd0aac778e32c72f97db425d67d9274972635b1fb35690bc398981c89c9b00caadb9ed05bb083cb075b4d19f232199513b49aa8c39edb82507abdd6a3f1f402dc', 'JnogyQbGMyFWCplxJt0h', '533c319399c3722d30b71f3070ad62079dbc7188e2f20130bfe20887ecb5a783ba4f2dbc52de99e39fbaf3ee2587e5b8bd347b7a46dc6c809424330df5317a74', '2014-07-15 19:07:10', '2014-07-15 19:07:10', 1234566789, 'male')
---
  def create
    @user = User.new(params[:user])
    puts("here")

    # Saving without session maintenance to skip
    # auto-login which can't happen here because
    # the User has not yet been activated
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = '4') LIMIT 1
---
  def show
    if (params[:id])
      @user = User.find(params[:id])

UPDATE `users` SET `password_salt` = 'Epk9JctqQ0bNcGB1tfBR', `crypted_password` = '74607622d5d5c875c8d421c4438e748563d071453b85b7a58cbe29804259f5c9d32cd1ea3e4a177377abad332d4acd06631ed1897e741be02b40ea845bdef2af', `persistence_token` = 'bd87158aa1f34e294a9df8030a9e9e8d56ba4d7ac84731556d5786f7a1c49b17eabec12c22845b49a5da2e413535a68dee92c22b66c17100dddb2fd26b5ff199', `gender` = 'm', `phone` = 23213123, `updated_at` = '2014-07-16 10:10:03' WHERE `id` = 5
---
  def update
    @user = current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])